IDENTIFICATION DIVISION.
PROGRAM-ID. test5_disappear.

ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
  EXEC SQL AT CONN1 SAVEPOINT SP1 END-EXEC
  EXEC SQL AT CONN1 SELECT SUM(FLD2 )  INTO :T2   FROM TAB2  END-EXEC.
  
  DISPLAY 'HELLO WORLD ' END-DISPLAY
  EXEC SQL AT CONN1 ROLLBACK  TO SAVEPOINT SP1 END-EXEC.
