       program-id. prog1.
       procedure division.
           goback.
       end program prog1.

       program-id. prog2.
       procedure division.
           goback.
       end program prog2.
