       program-id. prog.
       data division.
       working-storage section.
       77 s pic AA value "AB".
       procedure division.
           stop s.
