       program-id. prog.
       data division.
       working-storage section.
       77 s pic XX value "42".
       procedure division.
           stop s.
