       >>SOURCE FORMAT IS FREE
identification division.
program-id. test.

environment division.

data division.

procedure division.

    display 'hello world'.
    stop run.
