       IDENTIFICATION DIVISION.
       PROGRAM-ID. test_1. 
       DATA DIVISION.  

       FILE SECTION.
      
       WORKING-STORAGE SECTION. 
         
       EXEC SQL INCLUDE SQLCA END-EXEC. 
       
       PROCEDURE DIVISION. 

           STOP RUN.